# Test 1 (Query Q-2TP-1MFS-STAR)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'DR' }

# Test 2 (Query Q-4TP-3MFS-CHAIN)
SELECT * WHERE { <http://www.Department0.University0.edu/UndergraduateStudent33> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y16 }

# Test 3 (Query Q-5TP-4MFS-COMPOSITE)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?S <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?X . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }

# Test 4 (Query Q-7TP-3MFS-STAR)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#UndergraduateStudent> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University0.edu/FullProfessor0> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#takesCourse> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 }

# Test 5 (Query Q-9TP-3MFS-COMPOSITE)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?S <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?X . ?S <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y7 }

# Test 6 (Query Q-12TP-4MFS-STAR)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Faculty> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }
