# Test 1 (Query 1TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> }

# MFS 1
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> }

# XSS 1

# Test 2 (Query 1TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#VisitingProfessor> }

# MFS 2
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#VisitingProfessor> }

# XSS 2

# Test 3 (Query 1TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#UnderGraduateStudent> }

# MFS 3
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#UnderGraduateStudent> }

# XSS 3

# Test 4 (Query 1TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Article> }

# MFS 4
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Article> }

# XSS 4

# Test 5 (Query 1TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#AdministrativeStaff> }

# MFS 5
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#AdministrativeStaff> }

# XSS 5

# Test 6 (Query 2TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y1 }

# MFS 6
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> }

# XSS 6

# Test 7 (Query 2TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# MFS 7
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# XSS 7
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 8 (Query 2TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 }

# MFS 8
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 }

# XSS 8
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 9 (Query 2TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareVersion> ?Y1 }

# MFS 9
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareVersion> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> }

# XSS 9

# Test 10 (Query 2TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Publication> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> ?Y1 }

# MFS 10
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> ?Y1 }

# XSS 10
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Publication> }

# Test 11 (Query 3TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareVersion> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# MFS 11
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareVersion> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Software> }

# XSS 11

# Test 12 (Query 3TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Publication> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# MFS 12
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# XSS 12
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Publication> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 }

# Test 13 (Query 3TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }

# MFS 13
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }

# XSS 13
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 14 (Query 3TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# MFS 14
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# XSS 14
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 15 (Query 3TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# MFS 15
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }

# XSS 15
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 16 (Query 4TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }

# MFS 16
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# XSS 16
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# Test 17 (Query 4TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 }

# MFS 17
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }

# XSS 17
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' }

# Test 18 (Query 4TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# MFS 18
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# XSS 18
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 19 (Query 4TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# MFS 19
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# XSS 19
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 20 (Query 4TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# MFS 20
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }

# XSS 20
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 21 (Query 5TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# MFS 21
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# XSS 21
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 22 (Query 5TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }

# MFS 22
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# XSS 22
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 23 (Query 5TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }

# MFS 23
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# XSS 23
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 24 (Query 5TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }

# MFS 24
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }

# XSS 24
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 25 (Query 5TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 }

# MFS 25
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }

# XSS 25
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 }

# Test 26 (Query 6TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }

# MFS 26
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# XSS 26
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 27 (Query 6TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# MFS 27
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# XSS 27
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 28 (Query 6TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# MFS 28
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }

# XSS 28
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }

# Test 29 (Query 6TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# MFS 29
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# XSS 29
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 }

# Test 30 (Query 6TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# MFS 30
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 30
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 31 (Query 7TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# MFS 31
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 31
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 32 (Query 7TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# MFS 32
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }

# XSS 32
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# Test 33 (Query 7TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }

# MFS 33
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }

# XSS 33
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 34 (Query 7TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }

# MFS 34
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }

# XSS 34
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 35 (Query 7TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor4> }

# MFS 35
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor4> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# XSS 35
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#University> }

# Test 36 (Query 8TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# MFS 36
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 36
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 }

# Test 37 (Query 8TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }

# MFS 37
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }

# XSS 37
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }

# Test 38 (Query 8TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 }

# MFS 38
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# XSS 38
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 }

# Test 39 (Query 8TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 }

# MFS 39
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 39
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 }

# Test 40 (Query 8TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University875.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 }

# MFS 40
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University875.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# XSS 40
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University875.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y4 }

# Test 41 (Query 9TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 }

# MFS 41
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 41
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# Test 42 (Query 9TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5542' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }

# MFS 42
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5542' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }

# XSS 42
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }

# Test 43 (Query 9TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# MFS 43
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# XSS 43
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 44 (Query 9TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 }

# MFS 44
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# XSS 44
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 }

# Test 45 (Query 9TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }

# MFS 45
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# XSS 45
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 }

# Test 46 (Query 10TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }

# MFS 46
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }

# XSS 46
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor6> }

# Test 47 (Query 10TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'PhD' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# MFS 47
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'PhD' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }

# XSS 47
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }

# Test 48 (Query 10TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# MFS 48
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 48
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 }

# Test 49 (Query 10TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }

# MFS 49
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }

# XSS 49
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }

# Test 50 (Query 10TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor2@Department0.University0' }

# MFS 50
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor2@Department0.University0' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 50
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# Test 51 (Query 11TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y6 }

# MFS 51
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }

# XSS 51
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 }

# Test 52 (Query 11TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }

# MFS 52
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }

# XSS 52
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# Test 53 (Query 11TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 }

# MFS 53
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 53
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y4 }

# Test 54 (Query 11TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor2@Department0.University0' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# MFS 54
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor2@Department0.University0' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y5 }

# XSS 54
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# Test 55 (Query 11TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }

# MFS 55
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }

# XSS 55
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }

# Test 56 (Query 12TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }

# MFS 56
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }

# XSS 56
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research21' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'Lecturer4@Department0.University0.edu' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# Test 57 (Query 12TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }

# MFS 57
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 57
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# Test 58 (Query 12TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# MFS 58
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }

# XSS 58
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 }

# Test 59 (Query 12TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }

# MFS 59
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# XSS 59
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 60 (Query 12TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# MFS 60
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# XSS 60
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 61 (Query 13TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }

# MFS 61
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# XSS 61
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 }

# Test 62 (Query 13TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }

# MFS 62
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> }

# XSS 62
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University10.edu/FullProfessor7> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 }

# Test 63 (Query 13TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'PhD' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }

# MFS 63
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'PhD' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 63
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 }

# Test 64 (Query 13TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 }

# MFS 64
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }

# XSS 64
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 }

# Test 65 (Query 13TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }

# MFS 65
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }

# XSS 65
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 66 (Query 14TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# MFS 66
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }

# XSS 66
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y9 }

# Test 67 (Query 14TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# MFS 67
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# XSS 67
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research23' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y8 }

# Test 68 (Query 14TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }

# MFS 68
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }

# XSS 68
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }

# Test 69 (Query 14TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# MFS 69
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }

# XSS 69
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 70 (Query 14TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '5B' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y9 }

# MFS 70
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '5B' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }

# XSS 70
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y8 }

# Test 71 (Query 15TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }

# MFS 71
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 71
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# Test 72 (Query 15TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }

# MFS 72
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }

# XSS 72
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# MFS 73
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 73
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# Test 74 (Query 15TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y12 }

# MFS 74
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y12 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 74
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 75 (Query 15TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y11 }

# MFS 75
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 75
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }











