# Test 1 (Query 10TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' }

# MFS 1
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }

# XSS 1
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# Test 2 (Query 10TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }

# MFS 2
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }

# XSS 2
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }

# Test 3 (Query 10TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 3
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 }

# XSS 3
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 }

# Test 4 (Query 10TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 4
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }

# XSS 4
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }

# Test 5 (Query 10TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }

# MFS 5
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 5
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y10 }