# Test 1 (Query 1TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# MFS 1
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 1

# Test 2 (Query 1TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# MFS 2
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 2

# Test 3 (Query 1TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# MFS 3
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 3

# Test 4 (Query 1TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# MFS 4
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 4

# Test 5 (Query 1TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# MFS 5
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 5

# Test 6 (Query 2TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 }

# MFS 6
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 6
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 }

# Test 7 (Query 2TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 }

# MFS 7
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 7
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 }

# Test 8 (Query 2TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course08> }

# MFS 8
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course08> }

# XSS 8
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 9 (Query 2TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }

# MFS 9
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 9
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }

# Test 10 (Query 2TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# MFS 10
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# XSS 10
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 11 (Query 3TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# MFS 11
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 11
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 }

# Test 12 (Query 3TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }

# MFS 12
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 12
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }

# Test 13 (Query 3TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# MFS 13
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# XSS 13
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> }

# Test 14 (Query 3TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# MFS 14
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 14
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }

# Test 15 (Query 3TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }

# MFS 15
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# XSS 15
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 16 (Query 4TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }

# MFS 16
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 16
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 17 (Query 4TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 }

# MFS 17
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 17
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 }

# Test 18 (Query 4TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }

# MFS 18
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# XSS 18
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> }

# Test 19 (Query 4TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 }

# MFS 19
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 19
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 }

# Test 20 (Query 4TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# MFS 20
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# XSS 20
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> }

# Test 21 (Query 5TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }

# MFS 21
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 21
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 22 (Query 5TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 }

# MFS 22
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#Professor> }

# XSS 22
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 }

# Test 23 (Query 5TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 }

# MFS 23
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# XSS 23
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 }

# Test 24 (Query 5TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }

# MFS 24
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 24
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 }

# Test 25 (Query 5TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }

# MFS 25
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 25
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# Test 26 (Query 6TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }

# MFS 26
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 26
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 27 (Query 6TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# MFS 27
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# XSS 27
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 }

# Test 28 (Query 6TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# MFS 28
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# XSS 28
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 29 (Query 6TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 }

# MFS 29
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 29
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 }

# Test 30 (Query 6TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }

# MFS 30
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 30
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# Test 31 (Query 7TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }

# MFS 31
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 31
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 32 (Query 7TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 }

# MFS 32
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# XSS 32
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 }

# Test 33 (Query 7TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# MFS 33
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 33
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 34 (Query 7TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }

# MFS 34
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 34
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 }

# Test 35 (Query 7TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }

# MFS 35
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 35
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# Test 36 (Query 8TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }

# MFS 36
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 36
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 37 (Query 8TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# MFS 37
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# XSS 37
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# Test 38 (Query 8TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# MFS 38
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 38
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 39 (Query 8TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 }

# MFS 39
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 39
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 }

# Test 40 (Query 8TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# MFS 40
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 40
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# Test 41 (Query 9TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# MFS 41
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 41
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 42 (Query 9TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }

# MFS 42
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }

# XSS 42
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# Test 43 (Query 9TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }

# MFS 43
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 43
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 44 (Query 9TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 }

# MFS 44
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 44
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 }

# Test 45 (Query 9TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# MFS 45
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 45
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }

# Test 46 (Query 10TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }

# MFS 46
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 46
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 47 (Query 10TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 47
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 47
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# Test 48 (Query 10TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# MFS 48
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 48
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 49 (Query 10TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }

# MFS 49
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 49
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }

# Test 50 (Query 10TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }

# MFS 50
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 50
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }

# Test 51 (Query 11TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }

# MFS 51
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 51
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 }

# Test 52 (Query 11TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# MFS 52
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 52
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 53 (Query 11TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }

# MFS 53
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 53
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# Test 54 (Query 11TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 }

# MFS 54
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 54
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 }

# Test 55 (Query 11TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# MFS 55
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 55
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# Test 56 (Query 12TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }

# MFS 56
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 56
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }

# Test 57 (Query 12TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# MFS 57
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 57
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 58 (Query 12TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }

# MFS 58
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 58
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# Test 59 (Query 12TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }

# MFS 59
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 59
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 }

# Test 60 (Query 12TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }

# MFS 60
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 60
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# Test 61 (Query 13TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# MFS 61
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 61
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }

# Test 62 (Query 13TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 }

# MFS 62
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 62
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 63 (Query 13TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }

# MFS 63
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 63
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# Test 64 (Query 13TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }

# MFS 64
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 64
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }

# Test 65 (Query 13TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }

# MFS 65
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 65
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# Test 66 (Query 14TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }

# MFS 66
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 66
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }

# Test 67 (Query 14TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }

# MFS 67
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 67
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 68 (Query 14TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }

# MFS 68
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 68
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# Test 69 (Query 14TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 }

# MFS 69
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }

# XSS 69
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }

# Test 70 (Query 14TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }

# MFS 70
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 70
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

# Test 71 (Query 15TP-1)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y11 }

# MFS 71
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 71
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y9 }

# Test 72 (Query 15TP-2)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y12 }

# MFS 72
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y12 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# XSS 72
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y11 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# MFS 73
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }

# XSS 73
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course2> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y9 }

# Test 74 (Query 15TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }

# MFS 74
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> ?Y9 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '30' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }

# XSS 74
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?Y8 }

# Test 75 (Query 15TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }

# MFS 75
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5541' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> ?Y7 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> ?Y3 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 75
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> 'Research2' }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y6 }

