# Test 71 (Query 15TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }

# MFS 71
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }

# XSS 71
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }

# Test 72 (Query 15TP-2)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }

# MFS 72
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# XSS 72
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# MFS 73
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# XSS 73
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 74 (Query 15TP-4)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }

# MFS 74
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }

# XSS 74
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 }

# Test 75 (Query 15TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }

# MFS 75
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }
SELECT * WHERE { <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# XSS 75
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }

