# Test 1 (Query 1TP-1)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# MFS 1
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 1

# Test 2 (Query 1TP-2)
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }

# MFS 2
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }

# XSS 2

# Test 3 (Query 1TP-3)
SELECT * WHERE { <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }

# MFS 3
SELECT * WHERE { <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }

# XSS 3

# Test 4 (Query 1TP-4)
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }

# MFS 4
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }

# XSS 4

# Test 5 (Query 1TP-5)
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 }

# MFS 5
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 }

# XSS 5

# Test 6 (Query 2TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# MFS 6
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }

# XSS 6

# Test 7 (Query 2TP-2)
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 }

# MFS 7
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 7
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 }

# Test 8 (Query 2TP-3)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }

# MFS 8
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }

# XSS 8

# Test 9 (Query 2TP-4)
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# MFS 9
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 }

# XSS 9
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# Test 10 (Query 2TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }

# MFS 10
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }

# XSS 10

# Test 11 (Query 3TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# MFS 11
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 11
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 }

# Test 12 (Query 3TP-2)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }

# MFS 12
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 12
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 }

# Test 13 (Query 3TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }

# MFS 13
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 13
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }

# Test 14 (Query 3TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# MFS 14
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }

# XSS 14
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }

# Test 15 (Query 3TP-5)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }

# MFS 15
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 15

# Test 16 (Query 4TP-1)
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }

# MFS 16
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }

# XSS 16
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 17 (Query 4TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# MFS 17
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# XSS 17
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# Test 18 (Query 4TP-3)
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# MFS 18
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 18
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 19 (Query 4TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 }

# MFS 19
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }

# XSS 19
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 }

# Test 20 (Query 4TP-5)
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }

# MFS 20
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }

# XSS 20
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }

# Test 21 (Query 5TP-1)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }

# MFS 21
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# XSS 21
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }

# Test 22 (Query 5TP-2)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 22
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }

# XSS 22
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }

# Test 23 (Query 5TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }

# MFS 23
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> }

# XSS 23
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }

# Test 24 (Query 5TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }

# MFS 24
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }

# XSS 24
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 25 (Query 5TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }

# MFS 25
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }

# XSS 25
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }

# Test 26 (Query 6TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# MFS 26
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# XSS 26
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 27 (Query 6TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 }

# MFS 27
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 27
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 }

# Test 28 (Query 6TP-3)
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }

# MFS 28
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 }

# XSS 28
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }

# Test 29 (Query 6TP-4)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# MFS 29
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }

# XSS 29
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }

# Test 30 (Query 6TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }

# MFS 30
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 30
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }

# Test 31 (Query 7TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# MFS 31
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 }

# XSS 31
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# Test 32 (Query 7TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }

# MFS 32
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }

# XSS 32
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }

# Test 33 (Query 7TP-3)
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# MFS 33
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 }

# XSS 33
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }

# Test 34 (Query 7TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor2> . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }

# MFS 34
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor2> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# XSS 34
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }

# Test 35 (Query 7TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# MFS 35
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }

# XSS 35
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# Test 36 (Query 8TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 }

# MFS 36
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }

# XSS 36
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 }

# Test 37 (Query 8TP-2)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }

# MFS 37
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 }

# XSS 37
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }

# Test 38 (Query 8TP-3)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# MFS 38
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# XSS 38
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 39 (Query 8TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# MFS 39
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 39
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 40 (Query 8TP-5)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }

# MFS 40
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 40
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }

# Test 41 (Query 9TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 41
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }

# XSS 41
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }

# Test 42 (Query 9TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }

# MFS 42
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }

# XSS 42
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 43 (Query 9TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }

# MFS 43
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# XSS 43
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 }

# Test 44 (Query 9TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# MFS 44
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 44
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# Test 45 (Query 9TP-5)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 }

# MFS 45
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# XSS 45
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 }

# Test 46 (Query 10TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# MFS 46
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }

# XSS 46
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 47 (Query 10TP-2)
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# MFS 47
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 }

# XSS 47
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 }

# Test 48 (Query 10TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# MFS 48
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }

# XSS 48
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# Test 49 (Query 10TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }

# MFS 49
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 }

# XSS 49
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 }

# Test 50 (Query 10TP-5)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# MFS 50
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y1 }

# XSS 50
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 51 (Query 11TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 }

# MFS 51
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 }

# XSS 51
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }

# Test 52 (Query 11TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }

# MFS 52
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> }

# XSS 52
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.Department4.University11.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.University911.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }

# Test 53 (Query 11TP-3)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 }

# MFS 53
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }

# XSS 53
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 54 (Query 11TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# MFS 54
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y1 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }

# XSS 54
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 55 (Query 11TP-5)
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }

# MFS 55
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }

# XSS 55
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 }

# Test 56 (Query 12TP-1)
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }

# MFS 56
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }

# XSS 56
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }

# Test 57 (Query 12TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> }

# MFS 57
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 }

# XSS 57
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 }

# Test 58 (Query 12TP-3)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }

# MFS 58
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor4> }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 }

# XSS 58
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }

# Test 59 (Query 12TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }

# MFS 59
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> <http://www.Department0.University0.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 }

# XSS 59
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }

# Test 60 (Query 12TP-5)
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# MFS 60
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y1 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> }

# XSS 60
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }

# Test 61 (Query 13TP-1)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }

# MFS 61
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> }

# XSS 61
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.Department0.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 62 (Query 13TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor4> }

# MFS 62
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor4> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> }

# XSS 62
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }

# Test 63 (Query 13TP-3)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }

# MFS 63
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }

# XSS 63
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 }

# Test 64 (Query 13TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 }

# MFS 64
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }

# XSS 64
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 }
SELECT * WHERE { <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 }

# Test 65 (Query 13TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }

# MFS 65
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University444.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y1 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }

# XSS 65
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y8 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y1 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }

# Test 66 (Query 14TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }

# MFS 66
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University444.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 }

# XSS 66
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 }

# Test 67 (Query 14TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }

# MFS 67
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y7 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }

# XSS 67
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 }

# Test 68 (Query 14TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# MFS 68
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# XSS 68
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 . <http://www.Department0.University10.edu/AssistantProfessor1/Publication3> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# Test 69 (Query 14TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }

# MFS 69
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.Department2.University11.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# XSS 69
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }

# Test 70 (Query 14TP-5)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }

# MFS 70
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# XSS 70
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . <http://www.Department0.University15.edu/FullProfessor2/Publication1> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# Test 71 (Query 15TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }

# MFS 71
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University802.edu> }
SELECT * WHERE { <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University0.edu/AssistantProfessor0/Publication1> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# XSS 71
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y1 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }

# Test 72 (Query 15TP-2)
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }

# MFS 72
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.Department2.University1.edu> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y1 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y1 }

# XSS 72
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y11 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . <http://www.Department2.University16.edu/FullProfessor1/Publication2> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# MFS 73
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> <http://www.University902.edu> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.University92.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { <http://www.University958.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# XSS 73
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 74 (Query 15TP-4)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }

# MFS 74
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y1 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# XSS 74
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 }
SELECT * WHERE { <http://www.Department0.University11.edu/FullProfessor4> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 }

# Test 75 (Query 15TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 . <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }

# MFS 75
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }
SELECT * WHERE { <http://www.Department11.University0.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { <http://www.University829.edu> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }

# XSS 75
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }



