# Test 71 (Query 15TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }

# MFS 71
SELECT * WHERE { ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y15 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 71
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 }

# Test 72 (Query 15TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# MFS 72
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y15 }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 72
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# MFS 73
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 73
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# Test 74 (Query 15TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }

# MFS 74
SELECT * WHERE { ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y15 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y11 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 74
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }

# Test 75 (Query 15TP-5)
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 75
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y15 }
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y12 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 75
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y9 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y13 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

