# Test 1 (Query WWW1TP-6)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#VisitingProfessor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#memberOf> <http://www.Department1.University1.edu> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#name> ?Y1 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#emailAddress> ?Y2 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#telephone> ?Y3 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }

# MFS 1
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#VisitingProfessor> }
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#memberOf> <http://www.Department1.University1.edu> }

# XSS 1
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#name> ?Y1 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#emailAddress> ?Y2 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#telephone> ?Y3 . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }

# Test 2 (Query WWW2TP-4)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Professor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> <http://www.Department0.University0.edu> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research2" . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> ?Y }

# MFS 2
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> <http://www.Department0.University0.edu> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research2" }

# XSS 2
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Professor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> <http://www.Department0.University0.edu> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> ?Y }
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Professor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research2" . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> ?Y}

# Test 3 (Query WWW3TP-3)
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#undergraduateDegreeFrom> <http://www.University9.edu> . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#GraduateStudent> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#takesCourse> <http://www.Department0.University0.edu/GraduateCourse65> }

# MFS 3
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#undergraduateDegreeFrom> <http://www.University9.edu> }

# XSS 3
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#GraduateStudent> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#takesCourse> <http://www.Department0.University0.edu/GraduateCourse65> }

# Test 4 (Query WWW4TP-2)
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#advisor> ?Y . ?Y <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#headOf> <http://www.University476.edu> }

# MFS 4
SELECT * WHERE { ?Y <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#headOf> <http://www.University476.edu> }

# XSS 4
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#advisor> ?Y }

# Test 5 (Query WWW5TP-2)
SELECT * WHERE { <http://www.Department0.University0.edu/GraduateStudent73> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#advisor> ?Y . ?Y <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> <http://www.University0.edu> }

# MFS 5
SELECT * WHERE { ?Y <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> <http://www.University0.edu> }

# XSS 5
SELECT * WHERE { <http://www.Department0.University0.edu/GraduateStudent73> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#advisor> ?Y }

# Test 6 (Query WWW6TP-4)
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research28" . ?Y1 <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#subOrganizationOf> <http://www.University8.edu> . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Lecturer> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> ?Y1 }

# MFS 6
SELECT * WHERE { ?Y1 <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#subOrganizationOf> <http://www.University8.edu> }
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research28" . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Lecturer> }

# XSS 6
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#Lecturer> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> ?Y1 }
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research28" . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#worksFor> ?Y1 }

# Test 7 (Query WWW7TP-5)
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#FullProfessor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> <http://www.University8.edu> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research23" . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#teacherOf> ?Y1 . ?Y2 <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#takesCourse> ?Y1 }

# MFS 7
SELECT * WHERE { ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#doctoralDegreeFrom> <http://www.University8.edu> }

# XSS 7
SELECT * WHERE { ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#FullProfessor> . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#researchInterest> "Research23" . ?X <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#teacherOf> ?Y1 . ?Y2 <http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#takesCourse> ?Y1 }

