# Test 1 (Query 1TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }

# MFS 1
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }

# XSS 1

# Test 2 (Query 1TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor4> }

# MFS 2
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor4> }

# XSS 2

# Test 3 (Query 1TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor6@Department0.University0' }

# MFS 3
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor6@Department0.University0' }

# XSS 3

# Test 4 (Query 1TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# MFS 4
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# XSS 4

# Test 5 (Query 1TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# MFS 5
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# XSS 5

# Test 6 (Query 2TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# MFS 6
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }

# XSS 6
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# Test 7 (Query 2TP-2)
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }

# MFS 7
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y3 }

# XSS 7

# Test 8 (Query 2TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }

# MFS 8
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 8

# Test 9 (Query 2TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }

# MFS 9
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }

# XSS 9
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 }

# Test 10 (Query 2TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '5B' }

# MFS 10
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '5B' }

# XSS 10
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 }

# Test 11 (Query 3TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }

# MFS 11
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }

# XSS 11
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 }

# Test 12 (Query 3TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor2> }

# MFS 12
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor2> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# XSS 12
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 }

# Test 13 (Query 3TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }

# MFS 13
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }

# XSS 13
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }

# Test 14 (Query 3TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }

# MFS 14
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 14
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 }

# Test 15 (Query 3TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 15
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 15
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# Test 16 (Query 4TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }

# MFS 16
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# XSS 16
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 }

# Test 17 (Query 4TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }

# MFS 17
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 17
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 }

# Test 18 (Query 4TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# MFS 18
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }

# XSS 18
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 }

# Test 19 (Query 4TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }

# MFS 19
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#age> '35' }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 19
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 }

# Test 20 (Query 4TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 20
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 20
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# Test 21 (Query 5TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }

# MFS 21
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor4> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 21
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 }

# Test 22 (Query 5TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# MFS 22
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }

# XSS 22
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University921.edu> }

# Test 23 (Query 5TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }

# MFS 23
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.Department2.University0.edu> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 23
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 }

# Test 24 (Query 5TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }

# MFS 24
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 24
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 }

# Test 25 (Query 5TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }

# MFS 25
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }

# XSS 25
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University947.edu> }

# Test 26 (Query 6TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }

# MFS 26
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 26
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 27 (Query 6TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# MFS 27
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }

# XSS 27
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# Test 28 (Query 6TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }

# MFS 28
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> '935-223-5543' }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 28
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 }

# Test 29 (Query 6TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-06-01' }

# MFS 29
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-06-01' }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }

# XSS 29
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 }

# Test 30 (Query 6TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 30
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 30
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 }

# Test 31 (Query 7TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }

# MFS 31
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }

# XSS 31
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# Test 32 (Query 7TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }

# MFS 32
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 32
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University829.edu> }

# Test 33 (Query 7TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }

# MFS 33
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 33
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 }

# Test 34 (Query 7TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }

# MFS 34
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y7 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 34
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor6' }

# Test 35 (Query 7TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }

# MFS 35
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 35
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'AssociateProfessor5' }

# Test 36 (Query 8TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }

# MFS 36
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#officeNumber> '10A' }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 36
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 }

# Test 37 (Query 8TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# MFS 37
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 37
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# Test 38 (Query 8TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 38
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }

# XSS 38
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 }

# Test 39 (Query 8TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }

# MFS 39
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 39
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 }

# Test 40 (Query 8TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor6@Department0.University0' }

# MFS 40
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> 'AssociateProfessor6@Department0.University0' }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }

# XSS 40
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }

# Test 41 (Query 9TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }

# MFS 41
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y2 }

# XSS 41
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University822.edu> }

# Test 42 (Query 9TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }

# MFS 42
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department2.University6.edu/FullProfessor2/Publication1> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }

# XSS 42
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }

# Test 43 (Query 9TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }

# MFS 43
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> <http://www.Department0.University1.edu/FullProfessor5> }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }

# XSS 43
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 }

# Test 44 (Query 9TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }

# MFS 44
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor5> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 44
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 }

# Test 45 (Query 9TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }

# MFS 45
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> <http://www.Department0.University2.edu/FullProfessor2> }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 45
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }

# Test 46 (Query 10TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' }

# MFS 46
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Pr' }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y4 }

# XSS 46
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y10 }

# Test 47 (Query 10TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }

# MFS 47
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-02-01' }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }

# XSS 47
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 }

# Test 48 (Query 10TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 48
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 }

# XSS 48
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 }

# Test 49 (Query 10TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }

# MFS 49
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }

# XSS 49
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University15.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 }

# Test 50 (Query 10TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }

# MFS 50
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor2> }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 50
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y10 }

# Test 51 (Query 11TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }

# MFS 51
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationDate> '2015-04-01' }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }

# XSS 51
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }

# Test 52 (Query 11TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> }

# MFS 52
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University925.edu> }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y5 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 52
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 }

# Test 53 (Query 11TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }

# MFS 53
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 53
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }

# Test 54 (Query 11TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }

# MFS 54
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }

# XSS 54
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University16.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 }

# Test 55 (Query 11TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }

# MFS 55
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }

# XSS 55
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> <http://www.University17.edu> }

# Test 56 (Query 12TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> }

# MFS 56
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> <http://www.University91.edu> }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }

# XSS 56
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 }

# Test 57 (Query 12TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# MFS 57
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y3 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y2 }

# XSS 57
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# Test 58 (Query 12TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }

# MFS 58
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }

# XSS 58
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor2> }

# Test 59 (Query 12TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }

# MFS 59
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y2 }

# XSS 59
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 }

# Test 60 (Query 12TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# MFS 60
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }

# XSS 60
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course42> }

# Test 61 (Query 13TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 61
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y13 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 61
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# Test 62 (Query 13TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }

# MFS 62
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'false' }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y13 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y4 }

# XSS 62
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y12 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y12 }

# Test 63 (Query 13TP-3)
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# MFS 63
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 63
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }
SELECT * WHERE { <http://www.Department0.University12.edu/FullProfessor6> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> <http://www.Department0.University0.edu/Course8> }

# Test 64 (Query 13TP-4)
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# MFS 64
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y13 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y7 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y3 }
SELECT * WHERE { <http://www.Department0.University22.edu/FullProfessor8> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 }

# XSS 64
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y11 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# Test 65 (Query 13TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }

# MFS 65
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#title> 'Dr' }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y13 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y3 }

# XSS 65
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 }

# Test 66 (Query 14TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }

# MFS 66
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#tenured> 'true' }
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y14 }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y13 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 66
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y10 }

# Test 67 (Query 14TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# MFS 67
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y11 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 }

# XSS 67
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor4> }

# Test 68 (Query 14TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }

# MFS 68
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> <http://www.University878.edu> }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y10 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }

# XSS 68
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y14 }

# Test 69 (Query 14TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }

# MFS 69
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y12 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 69
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> 'FullProfessor3' }

# Test 70 (Query 14TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }

# MFS 70
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> <http://www.Department0.University5.edu/FullProfessor0/Publication2> }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y10 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y2 }

# XSS 70
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y5 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }

# Test 71 (Query 15TP-1)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# MFS 71
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y15 }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y5 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y3 }

# XSS 71
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y14 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y2 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department4.University3.edu> }

# Test 72 (Query 15TP-2)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }

# MFS 72
SELECT * WHERE { ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y12 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }

# XSS 72
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y15 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y15 }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y15 }

# Test 73 (Query 15TP-3)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# MFS 73
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y15 }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y13 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y11 }
SELECT * WHERE { ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliateOf> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y6 }
SELECT * WHERE { ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y4 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y2 }

# XSS 73
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y3 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y5 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y14 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> <http://www.Department0.University12.edu/FullProfessor5> }

# Test 74 (Query 15TP-4)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# MFS 74
SELECT * WHERE { ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y14 }
SELECT * WHERE { ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y12 }
SELECT * WHERE { ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y11 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#softwareDocumentation> ?Y2 }
SELECT * WHERE { ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 }

# XSS 74
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }
SELECT * WHERE { ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y6 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y8 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> ?Y10 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y13 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> <http://www.Department0.University1.edu/FullProfessor3> }

# Test 75 (Query 15TP-5)
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y12 . ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y13 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 . ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y15 . ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }

# MFS 75
SELECT * WHERE { ?Y15 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> <http://www.Department0.University10.edu/FullProfessor5> }
SELECT * WHERE { ?Y14 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#affiliatedOrganizationOf> ?Y15 }
SELECT * WHERE { ?Y12 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#member> ?Y13 }
SELECT * WHERE { ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 }
SELECT * WHERE { ?Y7 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#orgPublication> ?Y8 }
SELECT * WHERE { ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 }
SELECT * WHERE { ?Y4 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#hasAlumnus> ?Y5 }

# XSS 75
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y10 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y11 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y6 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y7 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }
SELECT * WHERE { ?Y1 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y2 . ?Y2 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#headOf> ?Y3 . ?Y3 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#subOrganizationOf> ?Y4 . ?Y5 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?Y6 . ?Y8 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#publicationAuthor> ?Y9 . ?Y9 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#advisor> ?Y10 . ?Y11 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?Y12 . ?Y13 <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?Y14 }














